from enum import Enum
from fake_useragent import UserAgent


class URLs(str, Enum):
    lots = "http://78.46.90.228/api/?ip=7.3.3.3&code=TDAjhTr53Sd9&sql=SELECT LOT FROM korea LIMIT {offset},250"
    vehicle_info = "https://api.encar.com/v1/readside/vehicle/{lot}?include=ADVERTISEMENT,CATEGORY,CONDITION,CONTACT,MANAGE,OPTIONS,PHOTOS,SPEC,PARTNERSHIP,CENTER,VIEW,CONDITIONS"
    vehicle_record = "https://api.encar.com/v1/readside/record/vehicle/{lot}/open?vehicleNo={vehicle_no}"
    vehicle_inspect = "https://api.encar.com/v1/readside/inspection/vehicle/{lot}"

    def __str__(self) -> str:
        return str.__str__(self)


class CREDENTIALS(Enum):
    headers = {
        "Host": "api.encar.com",
        "Sec-Ch-Ua": "\"Chromium\";v=\"135\", \"Not-A.Brand\";v=\"8\"",
        "Sec-Ch-Ua-Mobile": "?0",
        "Sec-Ch-Ua-Platform": "\"Windows\"",
        "User-Agent": UserAgent().random,
        "Accept": "application/json, text/plain, */*",
        "Accept-Language": "ru-RU,ru;q=0.9",
        "Accept-Encoding": "gzip, deflate, br",
        "Origin": "https://fem.encar.com",
        "Sec-Fetch-Site": "same-site",
        "Sec-Fetch-Mode": "cors",
        "Sec-Fetch-Dest": "empty",
        "Referer": "https://fem.encar.com/",
        "Priority": "u=1, i"
    }


class TRANSLATE(Enum):
    STATUS_TRANSLATION = {
        # Коды статусов
        '1': '양호', '2': '적정', '3': '없음', '4': '미세누수',
        '5': '누수', '6': '미세누유', '7': '누유', '8': '부족',
        '9': '과다', '10': '불량', '11': '있음',

        # Названия разделов
        '자가진단': 'Самодиагностика',
        '원동기': 'Двигатель',
        '변속기': 'Трансмиссия',
        '작동상태(공회전)': 'Рабочее состояние (холостой ход)',
        '오일누유': 'Утечка масла',
        '로커암 커버': 'Крышка коромысел',
        '실린더 헤드 / 가스켓': 'Головка цилиндра / Прокладка',
        '오일팬': 'Масляный поддон',
        '오일 유량': 'Уровень масла',
        '냉각수누수': 'Утечка охлаждающей жидкости',
        '워터펌프': 'Водяной насос',
        '라디에이터': 'Радиатор',
        '냉각수 수량': 'Уровень охлаждающей жидкости',
        '자동변속기(A/T)': 'Автоматическая коробка передач',
        '수동변속기(M/T)': 'Механическая коробка передач',
        '오일유량 및 상태': 'Уровень и состояние масла',
        '동력전달': 'Привод',
        '클러치 어셈블리': 'Сборка сцепления',
        '등속죠인트': 'ШРУС',
        '추친축 및 베어링': 'Карданный вал и подшипники',
        '조향': 'Рулевое управление',
        '동력조향 작동 오일 누유': 'Утечка масла ГУР',
        '작동상태': 'Рабочее состояние',
        '스티어링 기어': 'Рулевой механизм',
        '스티어링 펌프': 'Рулевой насос',
        '타이로드엔드 및 볼 죠인트': 'Наконечники рулевых тяг и шаровые шарниры',
        '제동': 'Тормозная система',
        '브레이크 마스터 실린더오일 누유': 'Утечка масла главного тормозного цилиндра',
        '브레이크 오일 누유': 'Утечка тормозной жидкости',
        '배력장치 상태': 'Состояние усилителя тормозов',
        '전기': 'Электрооборудование',
        '발전기 출력': 'Выход генератора',
        '시동 모터': 'Стартер',
        '와이퍼 모터 기능': 'Работа моторчика стеклоочистителя',
        '실내송풍 모터': 'Мотор вентилятора салона',
        '라디에이터 팬 모터': 'Мотор вентилятора радиатора',
        '윈도우 모터': 'Мотор стеклоподъемника',
        '기타': 'Прочее',
        '연료누출(LP가스포함)': 'Утечка топлива (включая газ)',

        # Статусы
        '양호': 'Хорошее',
        '적정': 'Нормальное',
        '없음': 'Отсутствует',
        '미세누수': 'Незначительная утечка',
        '누수': 'Течь',
        '미세누유': 'Незначительная утечка масла',
        '누유': 'Течь масла',
        '부족': 'Недостаточно',
        '과다': 'Избыток',
        '불량': 'Неисправность',
        '있음': 'Присутствует'
    }